#+TITLE: Mike Zamansky's Emacs configuration
#+STARTUP: overview
#+OPTIONS: toc:4 h:4
Use tab on each section to cycle through expanding and hiding sections
** Variables
#+BEGIN_SRC emacs-lisp
  (custom-set-variables
'(org-default-notes-file (concat org-directory "/notes.org"))
'(org-directory "~/cloud/orgfiles")
'(org-export-html-postamble nil)
'(org-hide-leading-stars t)
'(org-startup-folded (quote overview))
'(org-startup-indented t)
   )

  (setq org-file-apps
        (append '(
                  ("\\.pdf\\'" . "evince %s")
                  ) org-file-apps ))
 
(global-set-key "\C-ca" 'org-agenda)

(require 'ox-odt)
#+END_SRC   

#+RESULTS:
| org-startup-indented | t |
** Publish
#+begin_src emacs-lisp
(use-package ox-twbs
:ensure ox-twbs
)
(setq org-publish-project-alist
      '(
           ("blog-posts"
		:base-directory "~/gh/cestlaz.github.io/_org/"
      		:base-extension "org"
		:publishing-directory "~/gh/cestlaz.github.io/_drafts/"
		:recursive nil		      
;      		:publishing-function org-publish-org-to-html
:publishing-function org-html-publish-to-html
;:publishing-function org-twbs-publish-to-html
      		:headline-levels 4
		:auto-index nil
		:htmlized-source t
		:section-numbers nil
		:toc nil
      		:auto-preamble nil
		:table-of-contents nil
		:html-extension "html"		
		:body-only t
      		)
           ("apcs-hw"
		:base-directory "~/gh/stuycs-apcs-z.github.io/_org/"
      		:base-extension "org"
		:publishing-directory "~/gh/stuycs-apcs-z.github.io/_posts/"
		:recursive nil		      
;      		:publishing-function org-publish-org-to-html
      		:publishing-function org-html-publish-to-html
      		:headline-levels 4
		:auto-index nil
		:section-numbers nil
		:toc nil
      		:auto-preamble nil
		:table-of-contents nil
		:html-extension "html"		
		:body-only t
      		))

      )
#+end_src

#+RESULTS:
| blog-posts | :base-directory | ~/gh/cestlaz.github.io/_org/       | :base-extension | org | :publishing-directory | ~/gh/cestlaz.github.io/_drafts/      | :recursive | nil | :publishing-function | org-html-publish-to-html | :headline-levels | 4 | :auto-index | nil | :htmlized-source | t   | :section-numbers | nil | :toc           | nil | :auto-preamble     | nil | :table-of-contents | nil  | :html-extension | html | :body-only | t |
| apcs-hw    | :base-directory | ~/gh/stuycs-apcs-z.github.io/_org/ | :base-extension | org | :publishing-directory | ~/gh/stuycs-apcs-z.github.io/_posts/ | :recursive | nil | :publishing-function | org-html-publish-to-html | :headline-levels | 4 | :auto-index | nil | :section-numbers | nil | :toc             | nil | :auto-preamble | nil | :table-of-contents | nil | :html-extension    | html | :body-only      | t    |            |   |

** reveal
#+begin_src emacs-lisp
(setq org-reveal-mathjax t)
(use-package ox-reveal
:ensure ox-reveal)
(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
#+end_src

#+RESULTS:
: https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.2.0/js/reveal.min.js

* Key binding
#+begin_src emacs-lisp


(global-set-key (kbd "\e\ei")
		(lambda () (interactive) (find-file "~/cloud/orgfiles/i.org")))

(global-set-key (kbd "\e\ea")
		(lambda () (interactive) (find-file "~/cloud/orgfiles/apcs.org")))

(global-set-key (kbd "\e\es")
		(lambda () (interactive) (find-file "~/cloud/orgfiles/softdev.org")))
(global-set-key (kbd "\e\ec")
		(lambda () (interactive) (find-file "~/cloud/orgfiles/cstuy.org")))

#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (find-file ~/cloud/orgfiles/cstuy.org) |

